jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-h5.c
    if ((timings == NULL) ||
        !IS_FDCAN_NOMINAL_PRESCALER(timings->bit_rate_prescaler) ||
        !IS_FDCAN_NOMINAL_TSEG1(timings->bit_segment_1) ||
        !IS_FDCAN_NOMINAL_TSEG2(timings->bit_segment_2) ||
        !IS_FDCAN_NOMINAL_SJW(timings->sync_jump_width)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    memset(&dc_hal_stats, 0, sizeof(dc_hal_stats));
    abort_tx_on_error = (iface_mode == DC_HAL_IFACE_MODE_AUTOMATIC_TX_ABORT_ON_ERROR);

    fd_mode_enabled = (data_timings != NULL); // nullptr doesn't work, as undeclared
    fd_frame_detected = 0;

    switch (can_instance) { // 1, 2, ...
#ifdef FDCAN2
        case DC_HAL_CAN2: hfdcan.Instance = FDCAN2; break;
#endif
        default: // DC_HAL_CAN1
            hfdcan.Instance = FDCAN1;
    }
    __HAL_FDCAN_DISABLE_IT(&hfdcan, 0);

    hfdcan.Init.ClockDivider = FDCAN_CLOCK_DIV1;
    hfdcan.Init.Mode = FDCAN_MODE_NORMAL;

    hfdcan.Init.AutoRetransmission = ENABLE; // was DISABLE, ArduPilot has it enabled, so also do, no effect observed so far
    hfdcan.Init.TransmitPause = ENABLE; // insert pause between TX frames to reduce bus contention, probably a good thing to enable it
    hfdcan.Init.ProtocolException = DISABLE; // ST examples: treat exceptions as form errors instead of special state

    hfdcan.Init.NominalPrescaler = timings->bit_rate_prescaler;
    hfdcan.Init.NominalTimeSeg1 = timings->bit_segment_1;
    hfdcan.Init.NominalTimeSeg2 = timings->bit_segment_2;
    hfdcan.Init.NominalSyncJumpWidth = timings->sync_jump_width;

    if (fd_mode_enabled) {
        // enable FD frame format with BRS - allows receiving both classic CAN and CAN FD frames
        hfdcan.Init.FrameFormat = FDCAN_FRAME_FD_BRS;
        hfdcan.Init.DataPrescaler = data_timings->bit_rate_prescaler;
        hfdcan.Init.DataTimeSeg1 = data_timings->bit_segment_1;
        hfdcan.Init.DataTimeSeg2 = data_timings->bit_segment_2;
        hfdcan.Init.DataSyncJumpWidth = data_timings->sync_jump_width;
    } else {
        hfdcan.Init.FrameFormat = FDCAN_FRAME_CLASSIC; // FDCAN_FRAME_FD_NO_BRS, FDCAN_FRAME_FD_BRS
        hfdcan.Init.DataPrescaler = 1; // irrelevant if FrameFormat != FDCAN_FRAME_FD_BRS
        hfdcan.Init.DataTimeSeg1 = 1;
        hfdcan.Init.DataTimeSeg2 = 1;
        hfdcan.Init.DataSyncJumpWidth = 1;
    }

    hfdcan.Init.StdFiltersNbr = 0; // these are used in FDCAN_CalcultateRamBlockAddresses() called in HAL_FDCAN_Init()
    hfdcan.Init.ExtFiltersNbr = DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX;

    hfdcan.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION; // FDCAN_TX_QUEUE_OPERATION

    HAL_StatusTypeDef hres = HAL_FDCAN_Init(&hfdcan);
    if (hres != HAL_OK) {
        return -DC_HAL_ERROR_CAN_INIT;
    }

    if (fd_mode_enabled && data_timings->tdco > 0) { // enable Transceiver Delay Compensation for CANFD if needed
        HAL_FDCAN_ConfigTxDelayCompensation(&hfdcan, data_timings->tdco, 0);
        HAL_FDCAN_EnableTxDelayCompensation(&hfdcan);
    }

    // configure reception filter
    //   follow licanard's default filter setup in spirit
    //   here it is really needed since the FDCAN RAM was already set up for max num filters
    //   so we fill it with some default
    //   HAL_FDCAN_ConfigFilter() sets the filter registers even when it is disabled
    // at least one filter must be enabled for receive to work
    FDCAN_FilterTypeDef sFilterConfig = {};
    sFilterConfig.IdType = FDCAN_EXTENDED_ID;
    sFilterConfig.FilterIndex = 0;
    sFilterConfig.FilterType = FDCAN_FILTER_MASK; // classic filter: FilterID1 = id, FilterID2 = mask
    sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0; // FDCAN_FILTER_DISABLE, FDCAN_FILTER_TO_RXFIFO1
    sFilterConfig.FilterID1 = 0;
    sFilterConfig.FilterID2 = 0;

    for (uint8_t n = 0; n < DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX; n++) {
        //sFilterConfig.FilterConfig = ((n & 0x01) == 0) ? FDCAN_FILTER_TO_RXFIFO0 : FDCAN_FILTER_TO_RXFIFO1;
        sFilterConfig.FilterConfig = (n == 0) ? FDCAN_FILTER_TO_RXFIFO0 : FDCAN_FILTER_DISABLE;
        sFilterConfig.FilterIndex = n;
        hres = HAL_FDCAN_ConfigFilter(&hfdcan, &sFilterConfig);
        if (hres != HAL_OK) {
            return -DC_HAL_ERROR_CAN_CONFIG_FILTER;
        }
    }

    // configure global filter
    //  reject non matching frames with STD and EXT ID
    //  filter all remote frames with STD and EXT ID
    hres = HAL_FDCAN_ConfigGlobalFilter(&hfdcan, FDCAN_REJECT, FDCAN_REJECT, FDCAN_FILTER_REMOTE, FDCAN_FILTER_REMOTE);
    if (hres != HAL_OK) {
        return -DC_HAL_ERROR_CAN_CONFIG_GLOBAL_FILTER;
    }

    // FDCAN_RX_FIFO_BLOCKING, FDCAN_RX_FIFO_OVERWRITE ???
    //hres = HAL_FDCAN_ConfigRxFifoOverwrite(&hfdcan, FDCAN_RX_FIFO0, FDCAN_RX_FIFO_OVERWRITE);
    //hres = HAL_FDCAN_ConfigRxFifoOverwrite(&hfdcan, FDCAN_RX_FIFO1, FDCAN_RX_FIFO_OVERWRITE);

    //HAL_FDCAN_ConfigTxDelayCompensation(&hfdcan, 3, 0);
    //HAL_FDCAN_EnableTxDelayCompensation(&hfdcan);

    // CCE bit in FDCAN_CCCR register is automatically cleared when INIT bit in FDCAN_CCCR is cleared.
    //CLEAR_BIT(hfdcan.Instance->CCCR, FDCAN_CCCR_CCE);

    return 0;
}


int16_t dc_hal_start(void)
{
    if (hfdcan.Instance == NULL) { return -DC_HAL_ERROR_CAN_START; } // iface was never opened

    HAL_StatusTypeDef hres = HAL_FDCAN_Start(&hfdcan);
    if (hres != HAL_OK) { return -DC_HAL_ERROR_CAN_START; }

    return 0;
}


uint8_t dc_hal_is_canfd(void)
{
    return fd_frame_detected; // only ever becomes true if also fd_mode_enabled is true
}


//-------------------------------------------------------
// Transmit
//-------------------------------------------------------

int16_t dc_hal_transmit(const CanardCANFrame* const frame, uint32_t tnow_ms)
{
    if (hfdcan.Instance == NULL) { return -DC_HAL_ERROR_CAN_ADD_TX_MESSAGE; } // iface was never opened

    if (frame == NULL) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    if (frame->id & CANARD_CAN_FRAME_ERR) {
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }
    if (frame->id & CANARD_CAN_FRAME_RTR) { // DroneCAN does not use REMOTE frames
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }
    if (!(frame->id & CANARD_CAN_FRAME_EFF)) { // DroneCAN does not use STD ID, uses only EXT frames
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }

    if (!fd_mode_enabled && frame->data_len > 8) { // don't do FD if not enabled
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }

    _process_error_status();

    // thx to the TxFiFo in the H5 we can do the crude method and just put the message into the fifo if there is space
    // check for space in fifo
    if (HAL_FDCAN_GetTxFifoFreeLevel(&hfdcan) == 0) {
        if (tx_tlast_ms > 0 && (tnow_ms - tx_tlast_ms) > 10) {
            dc_hal_stats.tffl_count++; // TFFL, Tx Fifo Free Level
        }
        return 0; // no space, postpone
    }
    // this check is done in HAL_FDCAN_AddMessageToTxFifoQ(), so better do it here too
    if ((hfdcan.Instance->TXFQS & FDCAN_TXFQS_TFQF) != 0) {
        if (tx_tlast_ms > 0 && (tnow_ms - tx_tlast_ms) > 10) {
            dc_hal_stats.tfqf_count++; // TFQF, Tx Fifo Queue Full
        }
        return 0; // tx fifo queue full, postpone
    }

    FDCAN_TxHeaderTypeDef pTxHeader;
    pTxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE; // FDCAN_ESI_ACTIVE, FDCAN_ESI_PASSIVE ???
    if (fd_mode_enabled && frame->canfd) {
        pTxHeader.BitRateSwitch = FDCAN_BRS_ON;
        pTxHeader.FDFormat = FDCAN_FD_CAN;
    } else {
        pTxHeader.BitRateSwitch = FDCAN_BRS_OFF;
        pTxHeader.FDFormat = FDCAN_CLASSIC_CAN;
    }
    pTxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS; // FDCAN_STORE_TX_EVENTS
    pTxHeader.MessageMarker = 0; // this parameter must be a number between 0 and 0xFF

    pTxHeader.Identifier = (frame->id & CANARD_CAN_EXT_ID_MASK);
    pTxHeader.IdType = FDCAN_EXTENDED_ID;
    pTxHeader.TxFrameType = FDCAN_DATA_FRAME;

    // ATTENTION: the H5 HAL wants the plain DLC code here and shifts it into the T1 word
    // itself (FDCAN_DLC_BYTES_8 = 8), while the older G4 HAL wants it pre-shifted into the
    // register position (FDCAN_DLC_BYTES_8 = 0x00080000). So this must NOT be shifted here,
    // this line intentionally differs from the G4 driver.
    pTxHeader.DataLength = (uint32_t)_dlc_from_data_len(frame->data_len);

    HAL_StatusTypeDef hres = HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan, &pTxHeader, frame->data);
    if (hres != HAL_OK) {
        return -DC_HAL_ERROR_CAN_ADD_TX_MESSAGE;
    }

